Wang860503/nrf52840_shell/src/em4095/em4095.c
/*
 * Project name
     RFiD (Displaying CRC check of RFid card via Usart)
 * Copyright
     (c) mikroElektronika, 2010.
 * Revision History
     20091220:
       - initial release;
 * Description
     The code demonstrates using two external interrupts to read data sent
     by EM4095 chip (clock - RDY/CLK; data - OUT).
     Upon correct identification of the card, results are displayed via USART
     along with the card specific number.
 * Test configuration:
     MCU:             PIC18F4520
                      http://ww1.microchip.com/downloads/en/DeviceDoc/39631E.pdf
     Dev.Board:       EasyPIC6
                      http://www.mikroe.com/eng/products/view/297/easypic6-development-system/
     Oscillator:      HS-PLL, 32.0000 MHz
     Ext. Modules:    mE RFid Reader Board
                      ac:RFid_reader
                      http://www.mikroe.com/eng/products/view/185/rfid-reader-board/
     SW:              mikroC PRO for dsPIC30/33 and PIC24
                      http://www.mikroe.com/eng/products/view/231/mikroc-pro-for-dspic30-33-and-pic24/
 * NOTES:
     - mE RFid Reader Board should be connected to PORTA
     - Make sure you turn on the apropriate switches to enable USART
 communication (board specific)
     - Upon correct CRC check program will send "CRC CHECK OK!" via USART
     -  Connections can be established using flexible wire jumpers:
 http://www.mikroe.com/eng/products/view/495/wire-jumpers/ Used pins: Vcc, Gnd
                RA14 - OUT
                RA15 - RDY/CLK
                RA9 - SHD
                RA10 - MOD
*/
#include "em4095.h"

unsigned short sync_flag,  // in the sync routine if this flag is set
    one_seq,               // counts the number of 'logic one' in series
    data_in,     // gets data bit depending on data_in_1st and data_in_2nd
    cnt,         // interrupt counter
    cnt1, cnt2,  // auxiliary counters
    loopflag;    // indictae in loop or not
unsigned short detect_bus_counter;
unsigned short data_index;  // marks position in data arrey
char i;
char _data[256];
char data_valid[64];
char bad_synch;  // variable for detecting bad synchronization
unsigned short em_digit = 0;
unsigned long long em_card_code = 0;
unsigned short volatile em4095_detected;
unsigned short volatile em4095_reboot = 0;

const struct gpio_dt_spec demod_out_gpio =
    GPIO_DT_SPEC_GET(DT_ALIAS(em4095demodout), gpios);
const struct gpio_dt_spec shd_gpio =
    GPIO_DT_SPEC_GET(DT_ALIAS(em4095shd), gpios);
const struct gpio_dt_spec clk_gpio =
    GPIO_DT_SPEC_GET(DT_ALIAS(em4095clk), gpios);
/* undef for modiified hardware */
#define EM4095_SHD_HW_MOD 1 /* due to VIH needs 4V */

/* modified hw for BV test */
#define EM4095_SHD_WORKAROUND 0

#define EM4095_FSK_DETECTION 1

#ifdef EM4095_FSK_DETECTION
/*
#include "nrf.h"
#include "nrf_drv_gpiote.h"
#include "nrf_drv_timer.h"
// #include "bf_gpio.h"
#include "app_error.h"
*/
static struct gpio_callback demod_cb_data;
static uint16_t demod_counter = 0;
static uint16_t demod_check_counter = 0;
static uint16_t em4095_timer_expired = 0;

#define TICK_BUFFER_SIZE ((96 * 2 + 8) * 6) /* 200 */
uint32_t tick_buffer[TICK_BUFFER_SIZE] = {0, 0};
uint8_t fsk_bit_buffer[TICK_BUFFER_SIZE] = {0, 0};

/* 原本是 0x480 (1152) */
/* FSK '0' 約 975 ticks, FSK '1' 約 1220 ticks */
/* 中間值約 1097, 設定為 1100 以獲得最佳平衡 */
#define MIN_FSK_1_TICK 0x44C /* 1/12.5KHz = 80us, 1280 ticks when 16MHz */

uint32_t preview_tick = 0;
uint32_t current_tick = 0;
uint32_t threadhold = 0;
uint8_t fsk_bit_0_counter = 0;
uint8_t fsk_bit_1_counter = 0;
uint16_t header_position = 0;
uint8_t data_bit_count = 0;
uint8_t data_buf[96 - 6];
uint32_t original_data[3] = {0, 0};
uint8_t fsk_card_detected = 1;
uint8_t real_44bits_buffer[44];
uint16_t company_code, card_format, sc_code, ep, op, ep_sum, op_sum;
uint32_t pre_card_number = 0;
uint32_t card_number = 0;
uint16_t ep_35bit_sum, op_35bit_sum_all, op_35bit_sum;
uint16_t ep_37bit_sum, op_37bit_sum;
uint16_t ep_37bit_10302_sum, op_37bit_10302_sum;
uint16_t op1_sum, ep2_sum, op3_sum;
const nrfx_timer_t TIMER_EM4095 = NRFX_TIMER_INSTANCE(3);

static uint32_t last_capture_tick = 0;
static nrf_ppi_channel_t m_ppi_channel;
static const nrfx_gpiote_t m_gpiote = NRFX_GPIOTE_INSTANCE(0);
static bool m_gpiote_initialized = false;
#define EM4095_CAPTURE_CC_IDX 0
#define NOISE_GLITCH_THRESHOLD 200

void em4095_set_trigger_mode(enum PPI_TRIGGER_MODE mode) {
  uint8_t ch_index;
  nrfx_err_t err_code =
      nrfx_gpiote_channel_get(&m_gpiote, demod_out_gpio.pin, &ch_index);
  if (err_code != NRFX_SUCCESS) return;

  /* 先停用以進行修改 */
  nrf_gpiote_event_disable(NRF_GPIOTE, ch_index);
  nrf_gpiote_int_disable(NRF_GPIOTE, 1UL << ch_index);

  if (mode == ASK) {
    /* EM Mode: 雙邊緣觸發 (Toggle) 以捕捉脈衝寬度 */
    nrf_gpiote_event_configure(NRF_GPIOTE, ch_index, demod_out_gpio.pin,
                               NRF_GPIOTE_POLARITY_TOGGLE);
  } else {
    /* FSK Mode: 上升緣觸發 (LoToHi) */
    nrf_gpiote_event_configure(NRF_GPIOTE, ch_index, demod_out_gpio.pin,
                               NRF_GPIOTE_POLARITY_LOTOHI);
  }

  /* 重新啟用 */
  nrf_gpiote_event_enable(NRF_GPIOTE, ch_index);
  nrf_gpiote_int_enable(NRF_GPIOTE, 1UL << ch_index);
}

/* compare timer to calculate duration between low to high */
void pin_demod_handler(const struct device* dev, struct gpio_callback* cb,
                       uint32_t pins) {
  // nrf_drv_gpiote_out_toggle(PIN_OUT);
  if (pins & BIT(PIN_EM4095_DEMOD)) {
    current_tick = nrfx_timer_capture(&TIMER_EM4095, NRF_TIMER_CC_CHANNEL3);
    tick_buffer[demod_counter] = current_tick - preview_tick;
    preview_tick = current_tick;
    demod_counter++;
    demod_check_counter++;
    if (demod_counter >= TICK_BUFFER_SIZE) {
      // NRF_LOG_INFO("DEMOD_INTERRUPT!(%d) (%d)\n", tick_buffer[49],
      // tick_buffer[50]);
      em4095_gpio_sampling_disable();
      // demod_counter = 0;
    }
#if 0
        if((demod_counter & 1) == 1)
        {
            //NRF_LOG_INFO("DEMOD_INTERRUPT!(%d)\n", demod_counter);
            gpio_SetValue(1, 8, HIGH);
        }
        else
        {
            gpio_SetValue(1, 8, LOW);
        }
#endif
    // nrf_drv_timer_clear(&TIMER_EM4095);
  }
}

void demod_gpio_handler(nrfx_gpiote_pin_t pin, nrfx_gpiote_trigger_t trigger,
                        void* p_context) {
  if (demod_counter < TICK_BUFFER_SIZE) {
    // 1. 讀取 PPI 剛剛鎖存的「絕對時間」
    // 直接讀取暫存器，因為這個值是硬體在 event 發生的瞬間拍下的
    uint32_t current_absolute_tick = nrfx_timer_capture_get(
        &TIMER_EM4095, (nrf_timer_cc_channel_t)EM4095_CAPTURE_CC_IDX);

