Wang860503/nrf52840_shell/src/em4095/em4095.c
    // 2. 軟體相減計算 Delta (模擬原程式碼: tick = current - preview)
    // 這裡維持「累積計時」邏輯，不歸零 Timer，容錯率最高
    uint32_t period = current_absolute_tick - last_capture_tick;

    tick_buffer[demod_counter] = period;

    // 3. 更新 last_capture_tick
    last_capture_tick = current_absolute_tick;

    demod_counter++;
    demod_check_counter++;

    if (demod_counter >= TICK_BUFFER_SIZE) {
      em4095_gpio_sampling_disable();
    }
  }
}

void em4095_timer_event_handle(nrf_timer_event_t event_type, void* p_context) {
  /* NULL */
  // NRF_LOG_INFO("TIMER INTERRUPT!(%d) (%d)\n", tick_buffer[49],
  // tick_buffer[50]);
  switch (event_type) {
    case NRF_TIMER_EVENT_COMPARE3:
      em4095_timer_expired = 1;
      nrfx_timer_disable(&TIMER_EM4095);
      nrfx_timer_clear(&TIMER_EM4095);

      em4095_gpio_sampling_disable();
      if (demod_counter < (TICK_BUFFER_SIZE / 2)) {
        fsk_card_detected = 0;
      }
      // NRF_LOG_INFO("em4095 timer3 isr!!");
      break;

    default:
      // Do nothing.
      break;
  }
}

void em4095_timer_enable(void) {
  /* start timer */
  uint32_t time_ms =
      84;  // Time(in miliseconds) between consecutive compare events.
  uint32_t time_ticks;
  em4095_timer_expired = 0; /* clear */
  // demod_counter = 0;

  time_ticks = nrfx_timer_ms_to_ticks(&TIMER_EM4095, time_ms);

  nrfx_timer_extended_compare(&TIMER_EM4095, NRF_TIMER_CC_CHANNEL3, time_ticks,
                              NRF_TIMER_SHORT_COMPARE3_CLEAR_MASK, true);

  nrfx_timer_enable(&TIMER_EM4095);
  // preview_tick = nrf_drv_timer_capture(&TIMER_EM4095, NRF_TIMER_CC_CHANNEL3);
}

void em4095_timer_disable(void) {
  /* stop timer */
  nrfx_timer_disable(&TIMER_EM4095);
}

void em4095_gpio_sampling_enable(void) {
  last_capture_tick = 0;
  nrfx_timer_clear(&TIMER_EM4095);

  /* v3: 啟用 Trigger (包含中斷與 Event) */
  nrfx_gpiote_trigger_enable(&m_gpiote, demod_out_gpio.pin, true);

  /* 重要：v3 需要手動 hook 你的 callback 到 GPIOTE IRQ。
     如果你發現編譯無法通過 input_configure 設定 handler，
     你可能需要直接使用 nrfx_gpiote_global_callback_set(&demod_gpio_handler,
     NULL);
  */

  nrfx_ppi_channel_enable(m_ppi_channel);
  // preview_tick = nrf_drv_timer_capture(&TIMER_EM4095, NRF_TIMER_CC_CHANNEL3);
}

void em4095_gpio_sampling_disable(void) {
  nrfx_ppi_channel_disable(m_ppi_channel);
  /* v3: 停用 Trigger */
  nrfx_gpiote_trigger_disable(&m_gpiote, demod_out_gpio.pin);
}

void em4095_timer3_init(void) {
  nrfx_err_t err_code = NRFX_SUCCESS;

  /* 1. Timer Init */
  nrfx_timer_config_t timer_cfg =
      NRFX_TIMER_DEFAULT_CONFIG(NRF_TIMER_BASE_FREQUENCY_16MHZ);
  timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
  err_code =
      nrfx_timer_init(&TIMER_EM4095, &timer_cfg, em4095_timer_event_handle);
  if (err_code != NRFX_SUCCESS) {
    printk("Error: nrfx_timer_init fail code: %d\n", err_code);
  }

  /* 2. PPI Alloc */
  err_code = nrfx_ppi_channel_alloc(&m_ppi_channel);
  if (err_code != NRFX_SUCCESS) {
    printk("Error: PPI alloc failed\n");
  }

  /* 3. GPIOTE Init (Handle Already Initialized) */
  if (!m_gpiote_initialized) {
    err_code = nrfx_gpiote_init(&m_gpiote, 1);
    if (err_code == NRFX_SUCCESS ||
        err_code == NRFX_ERROR_ALREADY_INITIALIZED) {
      m_gpiote_initialized = true;
    } else {
      printk("Error: GPIOTE init failed: %d\n", err_code);
    }
  }

  /* 4. Channel Alloc */
  uint8_t ch_index;
  err_code = nrfx_gpiote_channel_alloc(&m_gpiote, &ch_index);
  if (err_code != NRFX_SUCCESS) {
    printk("Error: GPIOTE Channel Alloc Failed! Code: %d\n", err_code);
    return;
  }

  /* 5. 【關鍵修正】先 Uninit Pin，清除 Zephyr 狀態 */
  /* 如果這個 Pin 已經被 Zephyr 使用，nrfx 內部狀態可能是不一致的，強制重置它 */
  nrfx_gpiote_pin_uninit(&m_gpiote, demod_out_gpio.pin);

  /* 6. 設定結構體 */
  static const nrf_gpio_pin_pull_t pull_config = NRF_GPIO_PIN_NOPULL;

  nrfx_gpiote_trigger_config_t trigger_config = {
      .trigger = NRFX_GPIOTE_TRIGGER_LOTOHI,
      .p_in_channel = &ch_index,
  };

  nrfx_gpiote_handler_config_t handler_config = {
      .handler = (nrfx_gpiote_interrupt_handler_t)demod_gpio_handler,
      .p_context = NULL,
  };

  nrfx_gpiote_input_pin_config_t input_config = {
      .p_pull_config = &pull_config,
      .p_trigger_config = &trigger_config,
      .p_handler_config = &handler_config,
  };

  /* 7. 套用設定 */
  err_code =
      nrfx_gpiote_input_configure(&m_gpiote, demod_out_gpio.pin, &input_config);
  if (err_code != NRFX_SUCCESS) {
    printk("Error: Input Configure failed: 0x%08X\n", err_code);
  }

  /* 8. 【關鍵修正】改用 HAL 直接啟用 Trigger */
  /* * 這裡不呼叫 nrfx_gpiote_trigger_enable，因為它會檢查 pin_has_trigger 導致
   * Assert。 我們直接操作硬體，確保 Event 和 Interrupt 開啟。
   */

  /* 確保 Event 模式與極性正確 (冗餘但安全) */
  nrf_gpiote_event_configure(NRF_GPIOTE, ch_index, demod_out_gpio.pin,
                             NRF_GPIOTE_POLARITY_LOTOHI);

  /* 開啟 Event (給 PPI 用) */
  nrf_gpiote_event_enable(NRF_GPIOTE, ch_index);

  /* 開啟中斷 (給 CPU 用) */
  nrf_gpiote_int_enable(NRF_GPIOTE, 1UL << ch_index);

  /* 9. Event Address for PPI */
  nrf_gpiote_event_t gpiote_event = nrf_gpiote_in_event_get(ch_index);
  uint32_t gpiote_event_addr =
      nrf_gpiote_event_address_get(NRF_GPIOTE, gpiote_event);

  /* 10. PPI Assignment */
  uint32_t timer_capture_task_addr =
      nrfx_timer_capture_task_address_get(&TIMER_EM4095, EM4095_CAPTURE_CC_IDX);
  nrfx_ppi_channel_assign(m_ppi_channel, gpiote_event_addr,
                          timer_capture_task_addr);

  /* 11. IRQ Connect */
  IRQ_CONNECT(TIMER3_IRQn, 1, nrfx_isr, nrfx_timer_3_irq_handler, 0);
  irq_enable(TIMER3_IRQn);

  printk("EM4095 Timer3 & PPI Initialized Success\n");
}

void em4095_timer3_deinit(void) {
  /* Disable GPIO sampling first (this also disables PPI channel) */
  em4095_gpio_sampling_disable();

  /* Disable timer */
  em4095_timer_disable();

  /* Disable timer interrupts before uninit */
  irq_disable(TIMER3_IRQn);

  /* Uninitialize timer to release it */
  nrfx_timer_uninit(&TIMER_EM4095);

  /* Free PPI channel */
  nrfx_ppi_channel_free(m_ppi_channel);
}

unsigned short em4095_hid_receiver(void) {
  /* 1. confirm FSK signal
   * 2. open detection windows to detect 0x1D(detect 18 times 15.625KHz square
   * wave) 1 bit 400us, needs (96+8) * 400 = 41.60ms should be detect one time
   * at least in 42 ms if get 0x1D, should be detect one time to receive all
   * data again.
   * 3. timer interrupt service to detect fsk 0 and fsk 1
   *    fsk 0 : 15.625KHz * 6 (64us * 6 = 384us) -> 63.36-64.64 us
   *    fsk 1 : 12.5KHz * 5 (80us * 5 = 400us) -> 79.2-80.8 us
   *
   */
  uint16_t i;
  uint32_t redundant_word_26 = 0, redundant_word_35 = 0, redundant_word_37 = 0;
  unsigned short ret = 0;

