Wang860503/nrf52840_shell/src/em4095/em4095.c
  /* 42 ms timer test */
  /* need to find 0x1D(0x0001 1101), means 18*fsk_0 and 15*fsk_1 at least */
  memset(tick_buffer, 0, TICK_BUFFER_SIZE);
  memset(fsk_bit_buffer, 0, TICK_BUFFER_SIZE);
  while (1) {
    fsk_card_detected = 1;
    em4095_timer_enable();
    em4095_timer_expired = 0;
    demod_counter = 0;
    em4095_gpio_sampling_enable();
    // gpio_SetValue(1, 8, HIGH);
    // while(!em4095_timer_expired)
    //{
    nrf_delay_ms(84);
    //}
    // gpio_SetValue(1, 8, LOW);
    em4095_gpio_sampling_disable();
    em4095_timer_disable();
    if (demod_counter < (TICK_BUFFER_SIZE / 2)) {
      fsk_card_detected = 0;
    }
    break;
  }
  // NRF_LOG_INFO("fsk_card_detected = %d\n", fsk_card_detected);
  if (fsk_card_detected) {
#if 0
        /* decision adjustment */
        //NRF_LOG_INFO("[em4095] HID DETECTED!!!"); 
        uint16_t queue_data_1[64], queue_data_2[22];
        uint16_t queue_1_index = 0, queue_2_index = 0;
        
        for(i = 10; i < TICK_BUFFER_SIZE; i++)
        {
            if((tick_buffer[i] > 800) && (tick_buffer[i] < 1500))
            {
                queue_data_1[queue_1_index++] = tick_buffer[i];
                if(queue_1_index >= 64)
                {
                    break;
                }
            }
        }
        threadhold = 0;
        for(i = 0; i < 64; i++)
        {
            threadhold += queue_data_1[i];
        }
        threadhold >>= 6;
        uint8_t pre_bit = 0;
        queue_1_index = 0;
        for(i = 1; i < TICK_BUFFER_SIZE; i++)
        {
            if(tick_buffer[i] > 1500)
            {
                if(pre_bit)
                {
                    fsk_bit_buffer[queue_1_index++] = 1;
                    fsk_bit_buffer[queue_1_index++] = 0;
                }
                else
                {
                    fsk_bit_buffer[queue_1_index++] = 0;
                    fsk_bit_buffer[queue_1_index++] = 1;                    
                }
            }
            else if(tick_buffer[i] > threadhold)
            {
                fsk_bit_buffer[queue_1_index++] = 1;
                pre_bit = 1;
                //queue_1_index++;
            }

            else
            {
                fsk_bit_buffer[queue_1_index++] = 0;
                pre_bit = 0;
                //queue_1_index++;
            }
            if(queue_1_index>=TICK_BUFFER_SIZE)
            {
                break;
            }
        }
#else
    /*
    NRF_LOG_INFO("--- HID RAW TICKS ---");
    for (int k = 0; k < 20; k += 2) {
      // 印出完整週期 (Low + High)
      uint32_t period = tick_buffer[k] + tick_buffer[k + 1];
      NRF_LOG_INFO("[%d] %u", k, period);
    }
    */

    uint32_t accumulated_tick = 0;
    for (i = 0; i < TICK_BUFFER_SIZE; i++) {
      /* 取出當前數值 */
      uint32_t current_val = tick_buffer[i];

      /* 如果有累積的數值 (之前有雜訊)，加進來 */
      current_val += accumulated_tick;
      accumulated_tick = 0;  // 清空累積

      /* 檢查是否為極短雜訊 (Glitch) */
      if (current_val < NOISE_GLITCH_THRESHOLD) {
        /* 這是一個雜訊！不要判斷它，把它加到下一個數值去修復波形 */
        accumulated_tick = current_val;

        /* 暫時將這個 bit 標記為無效或預設值 (之後判斷 header 會自動忽略) */
        fsk_bit_buffer[i] = 0;
        continue;
      }

      if (tick_buffer[i] > MIN_FSK_1_TICK) {
        fsk_bit_buffer[i] = 1;
      } else
        fsk_bit_buffer[i] = 0;
    }
#endif
    /* search header */
    // NRF_LOG_INFO("[em4095] search header...");
    fsk_bit_0_counter = 0;
    fsk_bit_1_counter = 1;
    header_position = 0;
    memset(data_buf, 0xFF, sizeof(data_buf));
    for (i = 0; i < TICK_BUFFER_SIZE; i++) {
      if (fsk_bit_buffer[i] == 0) {
        fsk_bit_0_counter++;
      } else {
        if (fsk_bit_0_counter >= 14) {
          header_position = i; /* find the position of first fsk bit 1 */
          break;
        } else {
          fsk_bit_0_counter = 0;
        }
      }
    }
    if (header_position) {
      for (i = header_position; i < TICK_BUFFER_SIZE; i++) {
        if (fsk_bit_buffer[i] == 1) {
          fsk_bit_1_counter++;
        } else {
          if (fsk_bit_1_counter >= 13) {
            header_position =
                i; /* find the position of the last 2 bit of header */
            break;
          } else {
            fsk_bit_1_counter = 0;
          }
        }
      }
      data_bit_count = 0;
      fsk_bit_0_counter = fsk_bit_1_counter = 0;
      /* decision the fsk bit to data bit */
      for (i = header_position; i < TICK_BUFFER_SIZE; i++) {
        if (fsk_bit_buffer[i] == 1) {
          fsk_bit_1_counter++;
          if (fsk_bit_0_counter >= 4) {
            if (fsk_bit_0_counter > 8) {
              data_buf[data_bit_count++] = 0;
            }
            data_buf[data_bit_count++] = 0;
            fsk_bit_0_counter = 0;
          }
        } else {
          fsk_bit_0_counter++;
          if (fsk_bit_1_counter >= 4) {
            if (fsk_bit_1_counter > 8) {
              data_buf[data_bit_count++] = 1;
            }
            data_buf[data_bit_count++] = 1;
            fsk_bit_1_counter = 0;
          }
        }
        if (data_bit_count >= 90) {
          /* all data received */
          break;
        }
      }
#if 0
     for(i = 0; i < 26; i++)
     {
        original_data[0] |= (data_buf[i] << (25-i));
     }
     for(i = 26; i < 58; i++)
     {
        original_data[1] |= (data_buf[i] << (57-i));
     }
     for(i = 58; i < 90; i++)
     {
        original_data[2] |= (data_buf[i] << (89-i));
     }
     NRF_LOG_INFO("[em4095] HID card was detected!(0x%8X)(0x%8X)(0x%8X)", original_data[0], original_data[1], original_data[2]);
#endif
      memset(real_44bits_buffer, 0xFF, sizeof(real_44bits_buffer));
      for (i = 0; i < 88; i += 2) {
        real_44bits_buffer[43 - i / 2] = i + 1;
        if ((data_buf[2 + i] == 0) && (data_buf[2 + i + 1] == 1)) {
          real_44bits_buffer[43 - i / 2] = 0;
        } else if ((data_buf[2 + i] == 1) && (data_buf[2 + i + 1] == 0)) {
          real_44bits_buffer[43 - i / 2] = 1;
        } else {
          /* should not happen break! */
          // printk("should not happen break!\n");
          return 0;
        }
      }

      /* parity check */
      // NRF_LOG_INFO("[em4095] parity check...");
      /* HID 10302 */
      ep_sum = 0;
      op_sum = 0;
      /* should be 0 if even parity check */
      for (i = 13; i < 26; i++) ep_sum += (real_44bits_buffer[i] & 0x01);
      /* should be 1 if odd parity check */
      for (i = 0; i < 13; i++) op_sum += (real_44bits_buffer[i] & 0x01);
      /* 18 bits, 0x00801 */
      for (i = 26; i < 44; i++) {
        redundant_word_26 |= (real_44bits_buffer[i] << (i - 26));
      }
      /* corp 1000 35bits */ /* 34-0 */
      ep_35bit_sum = op_35bit_sum_all = op_35bit_sum = 0;
      ep_35bit_sum = real_44bits_buffer[33];
      op_35bit_sum = real_44bits_buffer[0];
      for (i = 1; i < 34; i += 3) {
        ep_35bit_sum += (real_44bits_buffer[i] + real_44bits_buffer[i + 1]);
        op_35bit_sum += (real_44bits_buffer[i + 1] + real_44bits_buffer[i + 2]);
      }
      for (i = 0; i < 35; i += 1) {
        op_35bit_sum_all += real_44bits_buffer[0];
      }
      /* 9 bits, 0x005 */
      for (i = 35; i < 44; i++) {
        redundant_word_35 |= (real_44bits_buffer[i] << (i - 35));
      }
      /* HID H10304 or H10302 */
      ep_37bit_sum = 0;
      op_37bit_sum = 0;
      for (i = 18; i < 37; i++) ep_37bit_sum += (real_44bits_buffer[i] & 0x01);
      for (i = 0; i < 19; i++) op_37bit_sum += (real_44bits_buffer[i] & 0x01);
      /* 7 bits, 0x00 */
      for (i = 37; i < 44; i++) {
        redundant_word_37 |= (real_44bits_buffer[i] << (i - 35));
      }

      /* show result */
      pre_card_number = card_number;
      card_number = 0;
      // if(((ep_sum & 0x01) == 0) && ((op_sum & 0x01) == 1) &&
      // (real_44bits_buffer[25] || real_44bits_buffer[26]) &&
      // (real_44bits_buffer[27] == 0))
      NRF_LOG_INFO("[em4095] show result...");
      if (((ep_sum & 0x01) == 0) && ((op_sum & 0x01) == 1) &&
          (redundant_word_26 == 0x0801)) {
        for (i = 1; i < 17; i++)
          card_number |= (real_44bits_buffer[i] << (i - 1));
        if (card_number != pre_card_number) {
          NRF_LOG_INFO("[em4095] HID(26-bits) Card NO: (%d)", card_number);
        } else {
          NRF_LOG_INFO("[em4095] [duplicate] HID(26 bits) Card NO: (%d)",
                       card_number);
        }
        tone_em4095_detected();
        ret = 1;
      }
      // else if(((ep_35bit_sum & 0x01) == 0) && ((op_35bit_sum & 0x01) == 1) &&
      // ((op_35bit_sum_all & 0x01) == 1))
      else if (((ep_35bit_sum & 0x01) == 0) && ((op_35bit_sum & 0x01) == 1) &&
               ((op_35bit_sum_all & 0x01) == 1) &&
               (redundant_word_35 == 0x005)) {
        card_number = 0;
        for (i = 1; i < 21; i++)
          card_number |= (real_44bits_buffer[i] << (i - 1));
        /* with facility code, H10304 */
        if (card_number != pre_card_number) {
          NRF_LOG_INFO("[em4095] HID(35 bits) Card NO: (%d)", card_number);
        } else {
          NRF_LOG_INFO("[em4095] [duplicate] HID(35 bits) Card NO: (%d)",
                       card_number);
        }
        ret = 1;
      }
      // else if(((ep_37bit_sum & 0x01) == 0) && ((op_37bit_sum & 0x01) == 1) &&
      // (real_44bits_buffer[36] || real_44bits_buffer[37]) &&
      // (real_44bits_buffer[38] == 0))
      else if (((ep_37bit_sum & 0x01) == 0) && ((op_37bit_sum & 0x01) == 1) &&
               (redundant_word_37 == 0x00)) {
        card_number = 0;
        for (i = 1; i < 20; i++)
          card_number |= (real_44bits_buffer[i] << (i - 1));
        /* with facility code, H10304 */
        if (card_number != pre_card_number) {
          NRF_LOG_INFO("[em4095] HID(37 bits) Card NO: (%d)", card_number);
        } else {
          NRF_LOG_INFO("[em4095] [duplicate] HID(37 bits) Card NO: (%d)",
                       card_number);
        }
        ret = 1;
      } else {
        NRF_LOG_INFO("[em4095] HID CRC failed!)");
      }
    }
#if 0
    /* removed it due to show this message when no card nearby */
    else
    {

