Wang860503/nrf52840_shell/src/em4095/em4095.c
        NRF_LOG_INFO("[em4095] failed to find heeader (%d)", threadhold);
    }
#endif
  }
  return ret;
}

#endif /* #ifdef EM4095_FSK_DETECTION */

void em4095_gpio_init(void) {
  int ret;
  nrfx_err_t err_code = NRFX_SUCCESS;

  if (!gpio_is_ready_dt(&demod_out_gpio) || !gpio_is_ready_dt(&shd_gpio) ||
      !gpio_is_ready_dt(&clk_gpio)) {
    printk("Error: EM4095 GPIOs not ready\n");
    return;
  }

#ifdef EM4095_FSK_DETECTION

#else  /* #ifdef EM4095_FSK_DETECTION */
  gpio_pin_configure_dt(&demod_out_gpio, GPIO_INPUT);
#endif /* #ifdef EM4095_FSK_DETECTION */
  /* Configure GPIO for em4095 */
  gpio_pin_configure_dt(&clk_gpio, GPIO_INPUT);
  // gpio_SetDir(PORT_EM4095_MOD, PIN_EM4095_MOD, SET_OUT);

#ifdef EM4095_SHD_WORKAROUND
  /* hardware used pull-up resitor */
  /* set gpio to input ping let SHD is high */
  gpio_pin_configure_dt(&shd_gpio, GPIO_INPUT);
#else                    /* #ifdef EM4095_SHD_WORKAROUND */

  /* due to SHD voltage is not enough, we should be modify hardware to fix it */
#ifdef EM4095_SHD_HW_MOD /* original without modifying hardware */
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_ACTIVE);
#else
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_INACTIVE);
#endif

#endif /* #ifdef EM4095_SHD_WORKAROUND */
  printk("EM4095 GPIO Initialized\n");
}

static void em4095_reset(void) {
#ifdef EM4095_SHD_WORKAROUND
  em4095_shd_sleep();
  nrf_delay_ms(1);
  em4095_shd_emit_rf();
#else                    /* #ifdef EM4095_SHD_WORKAROUND */
#ifdef EM4095_SHD_HW_MOD /* original without modifying hardware */
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_ACTIVE);
  nrf_delay_ms(1);
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_INACTIVE);
#else                    /* #ifdef EM4095_SHD_HW_MOD */
  gpio_SetValue(PORT_EM4095_SHD, PIN_EM4095_SHD, LOW);
  nrf_delay_ms(1);
  gpio_SetValue(PORT_EM4095_SHD, PIN_EM4095_SHD, HIGH);
#endif                   /* #ifdef EM4095_SHD_HW_MOD */
#endif                   /* #ifdef EM4095_SHD_WORKAROUND */
}

/* SHD:
   high - sleep
   low - enable
 */
void em4095_shd_sleep(void) {
#ifdef EM4095_SHD_WORKAROUND
  /* set gpio to input ping let SHD is high */
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_ACTIVE);
#else /* #ifdef EM4095_SHD_WORKAROUND */

#ifdef EM4095_SHD_HW_MOD /* original without modifying hardware */
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_INACTIVE);
#else
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_ACTIVE);
#endif

#endif /* #ifdef EM4095_SHD_WORKAROUND */
}

void em4095_shd_emit_rf(void) {
#ifdef EM4095_SHD_WORKAROUND
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_INACTIVE);
#else /* #ifdef EM4095_SHD_WORKAROUND */

#ifdef EM4095_SHD_HW_MOD /* original without modifying hardware */
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_ACTIVE); /* sleep mod*/
#else
  gpio_pin_configure_dt(&shd_gpio, GPIO_OUTPUT_INACTIVE);
#endif

#endif /* #ifdef EM4095_SHD_WORKAROUND */
}

void em4095_enable(void) {
#ifdef EM4095_FSK_DETECTION
  // NRF_LOG_INFO("em4095 em4095_timer3_init!!");
  em4095_timer3_init();
#endif /* #ifdef EM4095_FSK_DETECTION */
  em4095_shd_emit_rf();
}

char CRC_Check(char* bit_array) {
  char row_count, row_bit, column_count;
  char row_sum, column_sum;
  char row_check[5];
  char column_check[11];

  // row parity check:
  row_count = 9;  // count rows
  while (row_count < 59) {
    column_count = 0;  // count columns
    while (column_count < 5) {
      row_check[column_count] = bit_array[row_count + column_count];
      column_count++;
    }
    row_bit = 0;  // count row bits
    row_sum = 0;
    while (row_bit < 4) {
      row_sum = row_sum + row_check[row_bit];
      row_bit++;
    }

    // if (row_sum.B0 != row_check[4].B0)
    if ((row_sum & 0x01) != (row_check[4] & 0x01)) {
      return 0;
    }
    row_count = row_count + 5;
  }
  // end row parity check

  // column parity check
  column_count = 9;  // count columns
  while (column_count < 13) {
    row_bit = 0;    // count column bits
    row_count = 0;  // count rows
    while (row_bit < 11) {
      column_check[row_bit] = bit_array[column_count + row_count];
      row_bit++;
      row_count = row_count + 5;
    }

    row_bit = 0;  // count column bits
    column_sum = 0;
    while (row_bit < 10) {
      column_sum = column_sum + column_check[row_bit];
      row_bit++;
    }

    // if (column_sum.B0 != column_check[10].B0)
    if ((column_sum & 0x01) != (column_check[10] & 0x01)) {
      return 0;
    }
    column_count++;
  }
  // end column parity check
  if (bit_array[63] == 1) {
    return 0;
  }
  return 1;
}

unsigned short em4095_demod_check(void) {
  unsigned short result = 0, demod_check_timeout = 0, preStatus = 0;
  demod_check_counter = 0;
  em4095_reset();
  nrf_delay_ms(30);
  preStatus = gpio_pin_get_dt(&demod_out_gpio);
  ;
  while (demod_check_timeout < 20000) {
    demod_check_timeout++;
    nrf_delay_us(50);
    if (preStatus != gpio_pin_get_dt(&demod_out_gpio)) {
      preStatus = gpio_pin_get_dt(&demod_out_gpio);
      demod_check_counter++;
    }
    if (demod_check_counter >= 2) {
      result = 1;
      break;
    }
  }
  em4095_shd_sleep();
  return result; /* failed if 1 */
}

unsigned short em4095_clk_check(void) {
  /* 125KHz --> 8us per cycle */
  /* use to check 5V control work or not */
  unsigned short result = 1, detect_counter = 0;
  gpio_pin_configure_dt(&clk_gpio, GPIO_INPUT);
  /* do reset */
  nrf_delay_ms(10);
  em4095_reset();
  /* needs 25.60ms delay at least */
  nrf_delay_ms(30);

  while (gpio_pin_get_dt(&clk_gpio) == 1) {
    nrf_delay_us(2);
    detect_counter++;
    if (detect_counter >= 6) {
      result = 0;    /* clk did not work */
      return result; /* escape while loop */
    }
  }
  detect_counter = 0;
  while (gpio_pin_get_dt(&clk_gpio) == 0) {
    nrf_delay_us(2);
    detect_counter++;
    if (detect_counter >= 6) {
      result = 0; /* clk did not work */
      break;      /* escape while loop */
    }
  }
  return result;
}

#define DEBUG_EM4095 1

// 根據您的 Log 調整的數值
#define EM_SHORT_MIN 3000
#define EM_SHORT_MAX 4800
#define EM_LONG_MIN 6500
#define EM_LONG_MAX 9000

void clean_glitches(uint16_t count) {
  for (int i = 1; i < count - 1; i++) {
    if (tick_buffer[i] > 0 && tick_buffer[i] < 1500) {
      // 合併極短雜訊
      tick_buffer[i + 1] += tick_buffer[i];
      tick_buffer[i] = 0;
    }
  }
}

