Wang860503/nrf52840_shell/src/em4095/em4095.c
void decode_bitstream(uint16_t total_ticks, uint8_t* out_bits, int* out_len) {
  int bit_idx = 0;
  uint8_t current_val = 1;  // 假設 Header 為 1
  int state = 0;

  memset(out_bits, 0, 300);
  *out_len = 0;

  for (int i = 0; i < total_ticks; i++) {
    uint32_t T = tick_buffer[i];
    if (T == 0) continue;

    if (T > EM_LONG_MIN && T < EM_LONG_MAX) {
      // Long Pulse: 翻轉數值 (例如 0->1 或 1->0)
      if (state == 1) state = 0;  // 重置狀態
      current_val = !current_val;
      if (bit_idx < 300) out_bits[bit_idx++] = current_val;
      state = 0;
    } else if (T > EM_SHORT_MIN && T < EM_SHORT_MAX) {
      // Short Pulse: 保持數值
      if (state == 0) {
        state = 1;  // 等待第二個 Short
      } else {
        // 第二個 Short 到達，確認一個 Bit
        if (bit_idx < 300) out_bits[bit_idx++] = current_val;
        state = 0;
      }
    } else {
      // 異常長度，重置狀態
      state = 0;
    }
  }
  *out_len = bit_idx;
}

/* 3. 校驗與解碼 */
int check_and_decode(uint8_t* bits, uint64_t* result) {
  uint8_t data[64];

  // Header Check
  for (int k = 0; k < 9; k++)
    if (bits[k] != 1) return 0;
  // Stop Bit
  if (bits[63] != 0) return 0;

  // Copy
  for (int k = 0; k < 64; k++) data[k] = bits[k];

  // Parity Check (Full Matrix)
  uint8_t col_p[4] = {0};
  for (int r = 0; r < 10; r++) {
    int base = 9 + r * 5;
    int row_sum = 0;
    for (int c = 0; c < 4; c++) {
      row_sum += data[base + c];
      col_p[c] += data[base + c];
    }
    if ((row_sum + data[base + 4]) % 2 != 0) return 0;
  }
  for (int c = 0; c < 4; c++) {
    if ((col_p[c] + data[59 + c]) % 2 != 0) return 0;
  }

  // Decode
  *result = 0;
  for (int j = 0; j < 10; j++) {
    uint64_t digit = (data[9 + 5 * j] << 3) | (data[9 + 5 * j + 1] << 2) |
                     (data[9 + 5 * j + 2] << 1) | (data[9 + 5 * j + 3] << 0);
    *result |= (digit << (4 * (9 - j)));
  }
  return 1;
}

int EM4100_Full_Check(uint8_t* bits) {
  // 檢查 Header (9個1)
  for (int i = 0; i < 9; i++)
    if (bits[i] != 1) return 0;
  // 檢查 Stop Bit (1個0)
  if (bits[63] != 0) return 0;

  uint8_t col_parity_calc[4] = {0};

  // 檢查 Row Parity
  for (int row = 0; row < 10; row++) {
    int base = 9 + row * 5;
    int row_sum = 0;
    for (int col = 0; col < 4; col++) {
      uint8_t val = bits[base + col];
      row_sum += val;
      col_parity_calc[col] += val;
    }
    // 偶同位檢查
    if ((row_sum + bits[base + 4]) % 2 != 0) return 0;
  }

  // 檢查 Column Parity
  for (int col = 0; col < 4; col++) {
    if ((col_parity_calc[col] + bits[59 + col]) % 2 != 0) return 0;
  }
  return 1;  // 校驗通過
}

/* 4. 卡號轉換函式 (您缺失的部分) */
uint64_t decode_card_code(uint8_t* bits) {
  uint64_t code = 0;
  for (int j = 0; j < 10; j++) {
    unsigned int digit = (bits[9 + 5 * j] << 3) | (bits[9 + 5 * j + 1] << 2) |
                         (bits[9 + 5 * j + 2] << 1) |
                         (bits[9 + 5 * j + 3] << 0);
    code |= ((uint64_t)digit << (4 * (9 - j)));
  }
  /*total 40 bits, 保留最後 32 bits (8個 Hex)，過濾掉前面的 Customer ID*/
  return (code & 0xFFFFFFFF);
}

/* 4. 主接收函式 */
unsigned short em4095_em_receiver_ppi(void) {
  uint8_t raw_bits[350];
  int raw_bit_count = 0;

  // PPI 採樣
  em4095_set_trigger_mode(ASK);
  memset(tick_buffer, 0, TICK_BUFFER_SIZE * sizeof(uint32_t));

  em4095_timer_enable();
  em4095_timer_expired = 0;
  demod_counter = 0;

  em4095_gpio_sampling_enable();

  nrf_delay_ms(120);
  em4095_gpio_sampling_disable();
  em4095_timer_disable();

  em4095_set_trigger_mode(FSK);

  if (demod_counter < 64) return 0;

  clean_glitches(demod_counter);

  // 解碼
  decode_bitstream(demod_counter, raw_bits, &raw_bit_count);

  if (raw_bit_count < 64) return 0;

  // 搜尋卡號
  for (int i = 0; i <= raw_bit_count - 64; i++) {
    // 檢查 Header (九個 1)
    int header_match = 1;
    for (int k = 0; k < 9; k++)
      if (raw_bits[i + k] != 1) {
        header_match = 0;
        break;
      }
    if (!header_match) continue;

    // 提取 64 bits
    for (int k = 0; k < 64; k++) data_valid[k] = raw_bits[i + k];

    // 執行校驗
    if (EM4100_Full_Check(data_valid) == 1) {
      em_card_code = decode_card_code(data_valid);
      NRF_LOG_INFO("[em4095] Card Found: (%010llu)", em_card_code);
      tone_em4095_detected();
      return 1;
    }
  }

  return 0;
}

void em4095_em_receiver(void) {
  unsigned short preBit, currBit, wait16Clks;

  // --- [新增 1] 變數宣告與優先級設定 ---
  int old_prio;
  k_tid_t current_tid = k_current_get();  // 取得當前線程 ID

  // 1. 保存當前的優先級
  old_prio = k_thread_priority_get(current_tid);

  // 2. 將優先級設定為 -1 (Cooperative, 不可被其他線程搶佔)
  // 注意：這不會關閉硬體中斷，但會阻止其他 Task 插隊
  k_thread_priority_set(current_tid, -1);
  // ----------------------------------

  sync_flag = 0;   // sync_flag is set when falling edge on RA14 is detected
  one_seq = 0;     // counts the number of 'logic one' in series
  data_in = 0;     // gets data bit
  data_index = 0;  // marks position in data arrey
  cnt = 0;         // interrupt counter
  cnt1 = 0;        // auxiliary counter
  cnt2 = 0;        // auxiliary counter
  loopflag = 1;
  detect_bus_counter = 0;

  while (loopflag) {
    loopflag = 0;
    bad_synch = 0;  // set bad synchronization variable to zero
    cnt = 0;        // reseting interrupt counter
    sync_flag = 0;  // reseting sync flag

    /* check CLK bus */
    detect_bus_counter = 0;
    while (gpio_pin_get_dt(&clk_gpio) == 0) {
      nrf_delay_us(2);
      detect_bus_counter++;
      if (detect_bus_counter >= 6) {
        detect_bus_counter = 0;
        em4095_reboot = 1;

        // --- [新增 2] 錯誤返回前還原優先級 ---
        k_thread_priority_set(current_tid, old_prio);
        return;
      }
    }
    detect_bus_counter = 0;
    while (gpio_pin_get_dt(&demod_out_gpio) == 1) {
      nrf_delay_us(8);
      detect_bus_counter++;
      if (detect_bus_counter >= (32 * 3)) {
        // --- [新增 3] 錯誤返回前還原優先級 ---
        k_thread_priority_set(current_tid, old_prio);
        return;
      }
    }
    while (cnt != 16) {
      while (gpio_pin_get_dt(&clk_gpio) == 1) {
        __asm("nop");
      }
      while (gpio_pin_get_dt(&clk_gpio) == 0) {
        __asm("nop");
      }
      cnt++;
    }
    _data[0] = gpio_pin_get_dt(&demod_out_gpio) & 1;
    preBit = _data[0];
    wait16Clks = 0;
    for (data_index = 1; data_index <= 255; data_index++) {
      // getting 128 bits of data from DEMOD
      if (wait16Clks) {
        cnt = 16;  // reseting clock counter
      } else {
        cnt = 0;  // reseting clock counter
      }
      wait16Clks = 0;
      while (cnt != 32) {
        while (gpio_pin_get_dt(&clk_gpio) == 1) {
          __asm("nop");
        }
        while (gpio_pin_get_dt(&clk_gpio) == 0) {
          __asm("nop");
        }
        cnt++;
      }
      // reseting clock counter
      _data[data_index] = gpio_pin_get_dt(&demod_out_gpio) & 1;  // geting bit
      currBit = _data[data_index];
      if (currBit == preBit) {
        cnt = 0;
        if (currBit == 1) /* current is high, wait DEMOD to low */
        {
          while (gpio_pin_get_dt(&demod_out_gpio) == 1) {
            //__asm("nop");
            nrf_delay_us(8);
            cnt++;
            if (cnt > 32) {
              break; /* timeout and escape loop */
            }
          }
        } else /* current is low and wait DEMOD to high */
        {
          while (gpio_pin_get_dt(&demod_out_gpio) == 0) {
            //__asm("nop");
            nrf_delay_us(8);
            cnt++;
            if (cnt > 32) {
              break; /* timeout and escape loop */
            }
          }
        }
        if (cnt > 32) {
          bad_synch = 1;
          goto __BADSYNC;
        }
        wait16Clks = 1;
      }
      preBit = currBit;
    }
    for (data_index = 0; data_index <= 255; data_index++) {
      if (data_index & 1)
        if (!(_data[data_index] ^ _data[data_index - 1])) {
          // bad_synch = 1;
          break;  // bad synchronisation
        }
    }
  __BADSYNC:
    if (bad_synch) {
      // loopflag--;
      continue;  // try again
    }
    cnt1 = 0;
    one_seq = 0;
    for (cnt1 = 0; cnt1 <= 127;
         cnt1++) {  // we are counting 'logic one' in the data array
      if (_data[cnt1 << 1] == 1) {
        one_seq++;
      } else {
        one_seq = 0;
      }

