Wang860503/nrf52840_shell/src/em4095/em4095.c
      if (one_seq == 9) {  // if we get 9 'logic one' we break from the loop
        break;
      }
    }  //   (the position of the last  'logic one' is in the cnt1)

    if ((one_seq == 9) &&
        (cnt1 < 73)) {    //    if we got 9 'logic one' before cnt1 position 73
                          //   we write that data into data_valid array
      data_valid[0] = 1;  //   (it has to be before cnt1 position 73 in order
      data_valid[1] = 1;  //    to have all 64 bits available in data array)
      data_valid[2] = 1;
      data_valid[3] = 1;
      data_valid[4] = 1;
      data_valid[5] = 1;
      data_valid[6] = 1;
      data_valid[7] = 1;
      data_valid[8] = 1;
      for (cnt2 = 9; cnt2 <= 63; cnt2++) {  // copying the rest of data from the
                                            // data array into data_valid array
        cnt1++;
        data_valid[cnt2] = _data[cnt1 << 1];
      }
      if (CRC_Check(data_valid) ==
          1) {  // if data in data_valid array pass the CRC check

        em4095_detected = loopflag + 1;
        loopflag = 0;

        em_card_code = 0;
        for (i = 0; i < 10; i++) {
          em_digit = (data_valid[9 + 5 * i] << 3) |
                     (data_valid[9 + 5 * i + 1] << 2) |
                     (data_valid[9 + 5 * i + 2] << 1) |
                     (data_valid[9 + 5 * i + 3] << 0);
          em_card_code |= (em_digit << (4 * (9 - i)));
        }
        NRF_LOG_INFO("[em4095] EM4XXX Card NO: (%010llu)", em_card_code);
        // tone_em4095_detected();
      }
    }
  }

  // --- [新增 4] 正常結束前還原優先級 ---
  k_thread_priority_set(current_tid, old_prio);
}

// main program
void em4095_receiver(void) {
  if (em4095_reboot) {
    em4095_reboot = 0;
    em4095_reset();
#ifdef EM4095_SHD_HW_MOD
    /* needs 25.60ms delay at least */
    nrf_delay_ms(30);
#endif /* #ifdef EM4095_SHD_HW_MOD */
    NRF_LOG_INFO("[em4095] RESET!");
  }
#ifdef EM4095_FSK_DETECTION
  unsigned short result = em4095_hid_receiver();
  if (!result) {
    // NRF_LOG_INFO("[em4095] Trying use em!");
    //  int result = em4095_clk_check();
    //  NRF_LOG_INFO("[em4095] Check clk = %d!", result);
    em4095_em_receiver_ppi();
  } else {
    // tone_em4095_detected();
    em4095_detected = 1;
#ifdef EM4095_SHD_HW_MOD
    em4095_reboot = 1;
    /* need 25-35ms for PLL stable */
#endif /* EM4095_SHD_HW_MOD */
       /* reset em4095 again due to sometimes incorrect behavior */
  }
#else /* #ifdef EM4095_FSK_DETECTION */
  em4095_em_receiver();
#endif
}